<?php

									$mysql_host = 'ksa18ky.synology.me:3307';
									$mysql_user = 'ksa18ky';
									$mysql_password = 'Kywtbas2002!';
									$mysql_db = 'altruistic';

									$conn = new mysqli($mysql_host, $mysql_user, $mysql_password, $mysql_db);

									$id = $_SESSION[ 'user_id' ];
									$name = $_SESSION[ 'username' ];
									$s_name = $_POST[ 's_name' ];
									$me = $_POST[ 'me' ];
									$you = $_POST[ 'you' ];
									$success = 0;

									if($conn === false){
										die("ERROR: Could not connect. " . mysqli_connect_error());
									}
									 
									// Attempt insert query execution
									$sql = "INSERT INTO subject ( s_id, s_name_kor ) VALUES
													('HA2109','TOPIK한국어'),
													('CB4201','감염과면역'),
													('HA6203','과학기술과사회'),
													('HA6201','과학의역사와철학'),
													('CB4202','기초뇌과학'),
													('EPE2102','기초물리학(EC)'),
													('CB4103','기초분석화학'),
													('CB4102','기초유기화학'),
													('MC3105','기초정수론'),
													('EMC3105','기초정수론(EC)'),
													('CB4104','나노화학의입문'),
													('PE6201','도시계획과환경'),
													('HA2103','문학과사회'),
													('PE4102','물리학세미나'),
													('PE5107','물리학특강(물리학의통합적문제해결기법)'),
													('PE5105','물리학특강(전자회로의이해와응용)'),
													('MC3107','미분방정식'),
													('MC1108','미적분학1'),
													('MC3110','미적분학3'),
													('CB6202','법과학'),
													('CB2202','생명과학탐구'),
													('CB5202','생물학특강(생화학)'),
													('HA2701','생활미술'),
													('CB2102','생활속의화학'),
													('HA2601','생활음악'),
													('HA2801','생활체육1'),
													('MC3111','선형대수'),
													('EMC3111','선형대수(EC)'),
													('CB4203','세포와질환'),
													('HA2111','소통과화법'),
													('MC2103','수학3'),
													('MC2104','수학의활용'),
													('MC6101','수학적모델링'),
													('MC5105','수학특강(논리및집합)'),
													('MC5106','수학특강(현대수학의흐름)'),
													('HA2409','스페인언어와문화'),
													('HA2304','시사영어'),
													('MC4206','알고리즘'),
													('PE6101','예술속의물리'),
													('EPE3101','일반물리학1(EC)'),
													('EPE3103','일반물리학2(EC)'),
													('PE3102','일반물리학실험1'),
													('PE3104','일반물리학실험2'),
													('CB3201','일반생물학1'),
													('CB3202','일반생물학실험'),
													('PE3203','일반지구과학'),
													('PE3204','일반지구과학실험'),
													('PE3201','일반천문학'),
													('PE3202','일반천문학실험'),
													('CB3101','일반화학1'),
													('CB3103','일반화학2'),
													('CB3102','일반화학실험1'),
													('CB3104','일반화학실험2'),
													('HA2407','일본언어와문화'),
													('MC4205','자료구조'),
													('CB6102','전기화학에너지시스템'),
													('MC2201','정보과학3'),
													('HA2408','중국언어와문화'),
													('PE5204','지구과학특강(Urbanism, Environment, and Infrastructure)'),
													('PE5203','지구과학특강(해양학)'),
													('PE2202','지구환경과학'),
													('MC6201','창의적문제해결기법'),
													('PE2201','천체관측의기초'),
													('PE2101','탐구물리'),
													('MC3203','프로그래밍과문제해결'),
													('PE4101','현대물리학개론'),
													('CB4101','화학과에너지'),
													('CB4106','화학세미나'),
													('MC3108','확률및통계')
													";

									$result = mysqli_query($conn,$sql);

									if($result){
										echo "성공적으로 업로드 되었습니다";
									} else{
										echo "ERROR: Could not able to execute $sql. " . mysqli_error($conn);
									}
									 
									// Close connection
									mysqli_close($conn);
									?>